{
  "job": "Full-Stack Developer",
  "nav": {
    "lang": "Language",
    "contact": "Contact Me",
    "projects": "Projects",
    "experience": "Work Experience",
    "education": "Education",
    "profile": "About me",
    "brand": "Portfolio"
  },
  "section": {
    "title": {
      "about": "About me",
      "projects": "My Projects",
      "experience": "Work Experience",
      "education": "Education",
      "contact": "Contact Me"
    },
    "about": {
      "text": {
        "part1": "Hello, my name is Cyril, I am",
        "part2": "years old, and I am a Full-Stack Developer at AFR Financement, a network of credit brokerage centers located in Villeneuve-Saint-Germain.",
        "part3": "As a member of a development team, I work closely with my colleagues to design innovative digital solutions that meet the needs and expectations of our end users.",
        "part4": "In my current role, I am involved in all phases of web project development, from initial design to production deployment.",
        "part5": "I have worked on projects of all sizes, including simple websites, complex web applications, e-commerce projects, and even small mobile applications.",
        "part6": "I hope you enjoy my portfolio and have a great visit!"
      }
    },
    "experience": {
      "afr": {
        "date": "2019 – Present",
        "job": "Full-Stack Developer",
        "part1": "Development and maintenance of web applications used across the entire AFR Financement franchise, including: <ul><li><strong>CRM for credit brokers - personal financing</strong>: A Symfony-based web application designed to centralize lead management, client files, and contractual documents, with analytical tools and dedicated access for business introducers.</li><li><strong>CRM for credit brokers - professional financing</strong>: A web application offering similar functionalities to the personal financing CRM, but tailored to the specifics of professional financing processes.</li><li><strong>Borrower insurance contract comparison tool</strong>: Connected to around ten insurance company APIs, enabling automated comparisons of offers based on client profiles, with direct export to extranets to simplify subscriptions.</li><li><strong>Intranet</strong>: Centralizes all internal applications with advanced collaborative features to streamline user and brokerage center management.</li><li><strong>Forms</strong>: Design and development of interactive forms to efficiently collect prospect information. These forms are linked to CRMs for personalized and optimized follow-up, focusing on conversions.</li></ul>",
        "part2": "API and API integrations: <ul><li><strong>API for leads</strong>: Development of an external API enabling partners to directly send leads to the various CRMs, ensuring smooth and automated tracking.</li><li><strong>Yousign API Client</strong>: Creation of a PHP-based client to facilitate the integration of electronic signatures via the Yousign API.</li></ul>",
        "part3": "Network and system administration: <ul><li><strong>Site configuration on Windows Server</strong>: Setup of web applications and services hosted on Windows servers.</li><li><strong>Automated task scheduling</strong>: Implementation of scheduled tasks to automate processes such as report generation, data backups, or alerts.</li></ul>",
        "part4": "I played a key role in the design, development, and maintenance of strategic web solutions for AFR Financement. My work improved the operational efficiency of brokers, automated critical processes, and enhanced the user experience across the franchise."
      },
      "emiled": {
        "date": "11 weeks | 2016 – 2017",
        "job": "IT Intern",
        "part1": "Participation in projects aimed at enhancing customer loyalty and improving the user experience on e-commerce platforms.",
        "part2": "Optimization and maintenance of multi-store websites on <strong>Magento</strong>, including analysis and resolution of identified functional issues.",
        "part3": "Testing and validation of an online product customization solution, along with the creation of video tutorials to facilitate end-user adoption.",
        "part4": "Design and execution of email campaigns using <strong>Mailchimp</strong>, from conception to dispatch, to support marketing initiatives.",
        "part5": "Creation of various graphic assets using <strong>Photoshop</strong>, tailored to marketing needs and product personalization."
      }
    },
    "education": {
      "insset": {
        "part1": "<strong>Degree:</strong> Master's in Cloud Computing & Mobility • with honors.",
        "part2": "<strong>Degree:</strong> Bachelor's in Digital Careers.",
        "description1": "This Master's program trains experts in mobile development, microservices, and cloud solutions. The curriculum emphasizes security, IoT, and project management, preparing students for roles such as engineers, project managers, or specialized consultants.",
        "description2": "The Bachelor's in Digital Careers at INSSET provides a strong foundation in digital technologies, web development, and cloud computing. It focuses on practical skills in application development, database management, and introductory machine learning, opening pathways to careers in the tech industry."
      },
      "claudel": {
        "part1": "<strong>Degree:</strong> BTS in IT Services to Organizations • with honors.",
        "part2": "<strong>Specialization:</strong> Software Solutions and Business Applications.",
        "description": "The BTS SIO trains professionals to design, develop, and maintain software solutions tailored to business needs. The Software Solutions and Business Applications specialization emphasizes development technologies, database management, and adapting digital tools to organizational requirements."
      },
      "nerval": {
        "part1": "<strong>Degree:</strong> Technological Baccalaureate • with high honors.",
        "part2": "<strong>Specializations:</strong> Information Systems Management and Film/Audio-Visual Studies.",
        "description": "The STMG Baccalaureate with the Information Systems Management option introduces students to web development and data management fundamentals. The Film/Audio-Visual option complements this with a technical and creative approach to multimedia production."
      }
    },
    "filter": {
      "web": "WEB",
      "software": "SOFTWARE",
      "mobile": "MOBILE",
      "all": "ALL"
    }
  },
  "form": {
    "label": {
      "email": "Email",
      "message": "Message"
    },
    "btn": {
      "send": "SEND",
      "linkedin": "My LinkedIn Profile",
      "details": "+ Details"
    }
  }
}
