[
  {
    "id": 4,
    "titre-fr": "Gestionnaire de commandes",
    "description-fr": "Ce projet d'étude consistait à concevoir un logiciel de gestion de commandes en <strong>C#</strong> avec <strong>WinForms</strong>. Il permet de simplifier et d'organiser le suivi des commandes grâce à plusieurs fonctionnalités clés :<br><br><ul><li><strong>Interface de connexion sécurisée</strong> : Les utilisateurs s'authentifient avant d'accéder aux fonctionnalités de gestion.</li><li><strong>Visualisation des commandes</strong> : Consultation de la liste des commandes avec accès aux détails de chaque commande et des informations client associées.</li><li><strong>Gestion du statut des commandes</strong> : Mise à jour facile des statuts (payée, expédiée, en attente, etc.).</li><li><strong>Génération de PDF</strong> : Création automatique de fichiers PDF récapitulatifs pour une commande sélectionnée, offrant une vue complète pour archivage ou impression.</li></ul>",
    "titre-en": "Order Manager",
    "description-en": "This study project involved designing order management software in <strong>C#</strong> using <strong>WinForms</strong>. It simplifies and organizes order tracking through several key features:<br><br><ul><li><strong>Secure login interface</strong>: Users authenticate before accessing management functionalities.</li><li><strong>Order visualization</strong>: View the list of orders with access to each order's details and associated customer information.</li><li><strong>Order status management</strong>: Easily update statuses (paid, shipped, pending, etc.).</li><li><strong>PDF generation</strong>: Automatically create summary PDF files for selected orders, providing a comprehensive view for archiving or printing.</li></ul>",
    "miniature": "miniature-gestionnaire-commandes",
    "images": [
      "gestion-commandes-installation.webp",
      "gestion-commandes-login.webp",
      "gestion-commandes-menu.webp",
      "gestion-commandes-home.webp",
      "gestion-commandes-colisage.webp",
      "gestion-commandes-recherche.webp"
    ],
    "tag": [
      "Csharp",
      "WinForms",
      "Projet d'étude"
    ],
    "type": "software"
  },
  {
    "id": 6,
    "titre-fr": "Bingo - Simulation de jeu",
    "description-fr": "Ce logiciel est une simulation interactive de jeu de <strong>Bingo</strong>, conçue pour offrir une expérience ludique et accessible. <br><br><ul><li><strong>Paramétrage des parties</strong> : L'utilisateur peut configurer le nombre de joueurs (de 2 à 4) et saisir leur nom avant le début de la partie.</li><li><strong>Lecture des règles</strong> : Une option permet de consulter les règles du jeu avant de lancer la partie, pour s'assurer que tous les joueurs comprennent bien les mécanismes.</li><li><strong>Mécanisme de jeu</strong> : Pendant la partie, l'utilisateur peut cliquer sur \"Lancer la roue\" pour tirer un numéro aléatoire. Les joueurs doivent ensuite valider les numéros qui apparaissent sur leur grille.</li><li><strong>Détermination du gagnant</strong> : Le premier joueur à valider une ligne complète est déclaré gagnant, clôturant ainsi la partie.</li></ul>Ce projet a été développé en <strong>C#</strong> avec <strong>WinForms</strong>, mettant l'accent sur une interface simple et une logique de jeu intuitive.",
    "titre-en": "Bingo - Game Simulation",
    "description-en": "This software is an interactive <strong>Bingo</strong> game simulation designed to provide a fun and accessible experience. <br><br><ul><li><strong>Game setup</strong>: The user can configure the number of players (from 2 to 4) and enter their names before starting the game.</li><li><strong>Rules overview</strong>: An option allows users to read the game rules before starting, ensuring all players understand the mechanics.</li><li><strong>Game mechanics</strong>: During the game, the user can click on \"Spin the wheel\" to draw a random number. Players must then validate the numbers appearing on their cards.</li><li><strong>Winner determination</strong>: The first player to validate a full line is declared the winner, ending the game.</li></ul>This project was developed in <strong>C#</strong> using <strong>WinForms</strong>, focusing on a simple interface and intuitive game logic.",
    "miniature": "miniature-bingo",
    "images": [
      "bingo-1.webp",
      "bingo-2.webp",
      "bingo-3.webp"
    ],
    "tag": [
      "Csharp",
      "WinForms",
      "Projet personnel"
    ],
    "type": "software"
  },
  {
    "id": 1,
    "titre-fr": "Multi sites Magento & marketing",
    "description-fr": "Lors de mon stage en <strong>BTS SIO</strong>, j'ai eu l'opportunité de travailler sur la gestion de plusieurs sites e-commerce déployés avec <strong>Magento</strong>. <br><br><ul><li><strong>Optimisation de l'expérience utilisateur</strong> : J'ai réalisé des mises à jour et des améliorations pour rendre les sites plus conviviaux et augmenter les taux de conversion des ventes.</li><li><strong>Configuration de modules</strong> : Mise en place de modules automatisant des tâches comme la distribution de coupons et la gestion de promotions.</li><li><strong>Fidélisation des clients</strong> : Développement d'un système automatique de calcul des points de fidélité pour chaque achat, basé sur le montant total du panier.</li><li><strong>Campagnes marketing</strong> : Création et planification de newsletters pour les périodes de soldes, afin de maximiser l'engagement client.</li><li><strong>Support client amélioré</strong> : Intégration d'un chat en ligne sur chaque site, avec des modèles de réponses préétablis pour faciliter et accélérer les échanges avec les clients.</li></ul>",
    "titre-en": "Magento Multisite & marketing",
    "description-en": "During my internship in <strong>BTS SIO</strong>, I had the opportunity to work on managing multiple e-commerce sites deployed with <strong>Magento</strong>. <br><br><ul><li><strong>Optimizing user experience</strong>: I carried out updates and improvements to make the sites more user-friendly and increase sales conversion rates.</li><li><strong>Module configuration</strong>: Set up modules to automate tasks such as coupon distribution and promotion management.</li><li><strong>Customer loyalty</strong>: Developed an automatic system for calculating loyalty points for each purchase based on the total cart amount.</li><li><strong>Marketing campaigns</strong>: Created and scheduled newsletters for sales periods to maximize customer engagement.</li><li><strong>Enhanced customer support</strong>: Integrated an online chat for each site with pre-established response templates, enabling quick and easy communication with customers.</li></ul>",
    "miniature": "miniature-magento",
    "images": [
      "magento-site.webp",
      "magento-mailchimp.gif",
      "magento-cart-rule.webp",
      "magento-coupon.webp"
    ],
    "tag": [
      "Magento",
      "Multisite",
      "Mailing",
      "Mailchimp",
      "Photoshop"
    ],
    "type": "web"
  },
  {
    "id": 5,
    "titre-fr": "Module PrestaShop - Gestion fournisseurs",
    "description-fr": "Ce module pour <strong>PrestaShop</strong> est conçu pour optimiser la gestion des fournisseurs et des produits au sein du catalogue. Il offre une gestion avancée des fournisseurs avec la possibilité de :<br><br><ul><li>Attribuer plusieurs fournisseurs à un produit avec des prix d'achat différents.</li><li>Activer ou désactiver des fournisseurs selon les besoins.</li><li>Classer les fournisseurs par ordre de priorité.</li></ul>Une fonctionnalité d'<strong>automatisation</strong> a été développée pour activer automatiquement le produit le plus adapté selon les critères suivants :<br><ul><li>Meilleur prix d'achat.</li><li>Stock disponible le plus élevé.</li><li>Fournisseur avec la priorité la plus haute.</li></ul>Ce module est compatible avec la version 1.7.x de PrestaShop.",
    "titre-en": "PrestaShop Module - Supplier Management",
    "description-en": "This <strong>PrestaShop</strong> module is designed to optimize supplier and product management within the catalog. It offers advanced supplier management capabilities, allowing users to:<br><br><ul><li>Assign multiple suppliers to a product with different purchase prices.</li><li>Activate or deactivate suppliers as needed.</li><li>Sort suppliers by priority.</li></ul>An <strong>automation</strong> feature has been developed to automatically activate the most suitable product based on the following criteria:<br><ul><li>Best purchase price.</li><li>Highest available stock.</li><li>Supplier with the highest priority.</li></ul>This module is compatible with PrestaShop version 1.7.x.",
    "miniature": "miniature-prestashop",
    "images": [
      "dropship-1.webp",
      "dropship-2.webp",
      "dropship-3.webp",
      "dropship-4.webp"
    ],
    "tag": [
      "PHP",
      "PrestaShop",
      "Module",
      "Projet d'étude"
    ],
    "type": "web"
  },

  {
    "id": 3,
    "titre-fr": "Lazy Garden : L'assistant des jardiniers en herbe",
    "description-fr": "Lazy Garden est une application Android conçue pour aider les amateurs de jardinage à prendre soin de leurs plantes en temps réel. <br><br><ul><li><strong>Capteurs intelligents</strong> : des capteurs placés sur les pots collectent des données sur les besoins en eau, en lumière, et sur la température ambiante des plantes.</li><li><strong>Analyse dans le cloud</strong> : les données collectées sont envoyées dans le cloud où elles sont analysées par l'application pour fournir des recommandations précises.</li><li><strong>Notifications personnalisées</strong> : en fonction des données analysées, l'application envoie des notifications pour indiquer les actions nécessaires, comme l'arrosage ou le changement d'exposition à la lumière.</li><li><strong>Interface intuitive</strong> : l'application affiche des images en fonction de l'état des plantes, permettant aux utilisateurs de visualiser facilement leur évolution et leurs besoins.</li></ul>",
    "titre-en": "Lazy Garden: The Assistant for Budding Gardeners",
    "description-en": "Lazy Garden is an Android application designed to help gardening enthusiasts take care of their plants in real-time. <br><br><ul><li><strong>Smart sensors</strong>: Sensors placed on flowerpots collect data on the plants' water needs, light exposure, and ambient temperature.</li><li><strong>Cloud-based analysis</strong>: The collected data is sent to the cloud, where it is analyzed to provide precise recommendations.</li><li><strong>Personalized notifications</strong>: Based on the analyzed data, the application sends notifications to inform users of necessary actions, such as watering or adjusting light exposure.</li><li><strong>Intuitive interface</strong>: The app displays images reflecting the plants' current state, enabling users to easily visualize their condition and monitor their progress.</li></ul>",
    "miniature": "miniature-lazy-garden",
    "images": [
      "lazy-garden-1.webp",
      "lazy-garden-2.webp",
      "lazy-garden-3.webp",
      "lazy-garden-schema.webp"
    ],
    "tag": [
      "Android",
      "Firebase",
      "Android Studio",
      "Projet d'étude"
    ],
    "type": "mobile"
  },
  {
    "id": 7,
    "titre-fr": "Comparateur de contrats d'assurance emprunteur",
    "description-fr": "Il s'agit d'une application web développée en <strong>Symfony</strong> permettant de gérer les dossiers clients et de comparer des contrats d'assurance emprunteur. L'application est connectée à une dizaine d'API pour récupérer les contrats et les tarifications de différentes compagnies. <br><br><ul><li><strong>Comparaison des contrats d'assurance</strong> : le CRM fait la correspondance entre les données saisies par les utilisateurs et les exigences de chaque API. Un tableau comparatif est retourné avec les différents contrats disponibles pour les clients.</li><li><strong>Gestion des commissionnements</strong> : le CRM permet également la gestion des commissions et leur synthèse pour un suivi clair et efficace.</li><li><strong>Statistiques et suivi d'activité</strong> : une section dédiée permet d'analyser le volume de devis réalisés ainsi que des graphiques illustrant la typologie des clients.</li><li><strong>Export vers les extranets</strong> : les dossiers peuvent être exportés directement vers les extranets des compagnies d'assurance, évitant ainsi toute double saisie et simplifiant le processus de souscription.</li></ul>",
    "titre-en": "Borrower Insurance Contract Comparator",
    "description-en": "This is a web application developed with <strong>Symfony</strong> that allows managing client folders and comparing borrower insurance contracts. The application is connected to about ten APIs to retrieve contracts and pricing from different companies. <br><br><ul><li><strong>Insurance contract comparison</strong>: The CRM matches user-entered data with each API's requirements and returns a comparative table of available contracts for clients.</li><li><strong>Commission management</strong>: The CRM also handles commission tracking and provides a clear synthesis for easier management.</li><li><strong>Statistics and activity tracking</strong>: A dedicated section provides insights into the volume of quotes generated, along with charts illustrating client typologies.</li><li><strong>Export to extranets</strong>: Folders can be directly exported to insurance companies' extranets, avoiding double data entry and simplifying the subscription process.</li></ul>",
    "miniature": "miniature-comparateur-assurance",
    "images": [
      "comparateur.webp"
    ],
    "tag": [
      "Symfony 6",
      "PHP 8",
      "API",
      "MySQL"
    ],
    "type": "web"
  },
  {
    "id": 8,
    "titre-fr": "CRM pour courtiers en crédits - financements particuliers",
    "description-fr": "Ce CRM est une application web développée en <strong>Symfony</strong>, conçue spécialement pour les courtiers en crédits afin de simplifier la gestion des financements particuliers. Voici ses principales fonctionnalités :<br><br><ul><li><strong>Gestion des prospects et leads</strong> : suivi des interactions, ajout de notes, et modèles d'emails pré-remplis pour organiser des rendez-vous ou effectuer des relances.</li><li><strong>Gestion des dossiers de financement</strong> : centralisation des informations clients pour un suivi précis des demandes de financement et des étapes associées.</li><li><strong>Création et suivi des factures</strong> : génération rapide de factures, envoi par email, suivi des paiements, et archivage automatique dans les dossiers clients.</li><li><strong>Génération de documents contractuels et signatures électroniques</strong> : création automatique des contrats, suivi en temps réel des signatures électroniques, et archivage des documents signés dans les dossiers.</li><li><strong>Statistiques et analyses</strong> : vue globale pour les directeurs d'agence sur les activités, dossiers en cours ou passés, et factures en attente. Les conseillers accèdent à une vue restreinte de leurs propres données. Ces statistiques sont présentées sous forme de tableaux exportables en Excel pour des analyses approfondies.</li><li><strong>Apporteurs d'affaires</strong> : accès personnalisés permettant aux apporteurs d'affaires de saisir des prospects directement dans le CRM, avec suivi et gestion intégrée des prospects introduits.</li></ul>",
    "titre-en": "CRM for Credit Brokers - Personal Financing",
    "description-en": "This CRM is a web application developed with <strong>Symfony</strong>, specifically designed for credit brokers to streamline the management of personal financing. Here are its key features:<br><br><ul><li><strong>Lead and prospect management</strong>: Track interactions, add notes, and use pre-filled email templates to schedule appointments or send follow-ups.</li><li><strong>Financing case management</strong>: Centralize client information for precise tracking of financing requests and associated steps.</li><li><strong>Invoice creation and tracking</strong>: Quickly generate invoices, send them via email, monitor payments, and automatically archive them in client files.</li><li><strong>Contract generation and electronic signatures</strong>: Automatically generate contracts, track electronic signature processes in real-time, and archive signed documents in client files.</li><li><strong>Statistics and performance analysis</strong>: Agency directors have a global view of activities, ongoing or past cases, and unpaid invoices, while advisors access a restricted view of their own data. Statistics are presented in tables and can be exported to Excel for further analysis.</li><li><strong>Business introducers</strong>: Dedicated access rights allow business introducers to directly input prospects into the CRM, with integrated tools for tracking and managing introduced leads.</li></ul>",
    "miniature": "miniature-crm",
    "images": [
      "dashboard.webp",
      "etat_dossier.webp",
      "facture.webp",
      "suivi_dossier.webp",
      "stats.webp"
    ],
    "tag": [
      "Symfony 6",
      "PHP 8",
      "CRM",
      "MySQL"
    ],
    "type": "web"
  },

  {
    "id": 9,
    "titre-fr": "Pinsta : une application mobile inspirée d'Instagram",
    "description-fr": "Pinsta est une application mobile développée avec <strong>Flutter</strong> et <strong>Dart</strong>, reposant sur <strong>Firebase</strong> pour la gestion des données. Inspirée du réseau social Instagram, elle propose des fonctionnalités suivantes :<br><br><ul><li><strong>Inscription et personnalisation</strong> : création de compte, personnalisation du profil (photo, biographie, nom d’affichage).</li><li><strong>Partage de photos</strong> : prise, recadrage, ajout de filtres, rotation et publication pour partager du contenu avec ses abonnés.</li><li><strong>Recherche d’images libres de droits</strong> : intégration de l'API <strong>Pixabay</strong> pour rechercher et utiliser des photos via des mots-clés.</li><li><strong>Fil d’actualité et interactions sociales</strong> : système d’abonnements, fil personnalisé, et interactions via des \"j'aime\".</li></ul>",
    "titre-en": "Pinsta: an Instagram-inspired mobile app",
    "description-en": "Pinsta is a mobile application developed with <strong>Flutter</strong> and <strong>Dart</strong>, relying on <strong>Firebase</strong> for data management. Inspired by the social network Instagram, it offers the following features:<br><br><ul><li><strong>Sign-up and customization</strong>: account creation, profile customization (photo, biography, display name).</li><li><strong>Photo sharing</strong>: capture, crop, add filters, rotate, and publish photos to share with followers.</li><li><strong>Royalty-free image search</strong>: integration of the <strong>Pixabay</strong> API to search and use photos through keywords.</li><li><strong>Personalized feed and social interactions</strong>: subscription system, personalized feed, and interactions via \"likes\".</li></ul>",
    "miniature": "miniature-pinsta",
    "images": [
      "pinsta-app.webp",
      "pinsta-register.webp",
      "pinsta-login.webp",
      "pinsta-profile.webp",
      "pinsta-explorateur.webp",
      "pinsta-crop.webp",
      "pinsta-filter.webp",
      "pinsta-pixabay.webp",
      "pinsta-pixabay-resultats.webp",
      "pinsta-abonnement.webp"
    ],
    "tag": [
      "Flutter",
      "Dart",
      "Android Studio",
      "Firebase",
      "Projet d'étude"
    ],
    "type": "mobile"
  },
  {
    "id": 10,
    "titre-fr": "Intranet d’Entreprise Polyvalent",
    "description-fr": "Développé en binôme, cet intranet d’entreprise est une plateforme centralisée facilitant la collaboration interne, la gestion des ressources et l’accès aux outils métiers. Il vise à améliorer l’efficacité opérationnelle, fluidifier la communication et simplifier les processus quotidiens. Voici ses principales fonctionnalités :<br><br><ul><li><strong>Centralisation des applications métiers</strong> : Intégration de toutes les applications internes avec un accès rapide et une connexion \"en un clic\".</li><li><strong>Stockage cloud partagé</strong> : Un espace collaboratif pour stocker et partager des documents en toute sécurité.</li><li><strong>Outil de création de publications pour réseaux sociaux</strong> : Génération automatisée de visuels normés pour les réseaux sociaux, facilitant la gestion de la présence en ligne.</li><li><strong>Gestion des demandes et assistance</strong> : Système de ticketing intelligent et chat textuel intégré pour une prise en charge rapide des demandes.</li><li><strong>Connexion aux avis clients</strong> : Intégration avec une plateforme d’avis en ligne, affichant les retours clients directement sur l’intranet.</li><li><strong>Administration des accès utilisateurs</strong> : Gestion avancée des permissions, permettant un contrôle précis des autorisations sur les applications métiers.</li><li><strong>FAQ interactive</strong> : Base de connaissances avec moteur de recherche pour accéder rapidement aux réponses aux questions fréquentes.</li><li><strong>Notifications et interactions</strong> : Système d’alertes en temps réel pour les événements clés, anniversaires et mises à jour, avec possibilité de réaction via emojis.</li><li><strong>Sécurité renforcée</strong> : Connexion sécurisée avec authentification à deux facteurs (2FA) pour garantir un accès protégé.</li></ul><br>Toutes ces fonctionnalités ont été développées en interne, assurant une solution sur mesure, évolutive et parfaitement adaptée aux besoins de l’entreprise. Cet intranet constitue un levier stratégique pour la productivité, la collaboration et l’organisation au sein du réseau.",
    "titre-en": "Versatile Corporate Intranet",
    "description-en": "Developed in collaboration, this corporate intranet serves as a centralized platform for streamlining internal collaboration, resource management, and business tool accessibility. It enhances operational efficiency, facilitates communication, and simplifies daily workflows. Key features include:<br><br><ul><li><strong>Centralized Business Applications</strong>: Integration of all internal applications with quick access and one-click login.</li><li><strong>Shared Cloud Storage</strong>: A collaborative space for secure document storage and sharing.</li><li><strong>Social Media Content Creation Tool</strong>: Automated generation of standardized visuals for social media, simplifying brand communication.</li><li><strong>Request Management and Support</strong>: Smart ticketing system and integrated text chat for efficient request handling.</li><li><strong>Customer Review Integration</strong>: Direct connection to a review platform, displaying client feedback on the intranet.</li><li><strong>User Access Administration</strong>: Advanced permission management for branch directors, allowing precise control over access rights.</li><li><strong>Interactive FAQ</strong>: Knowledge base with a search engine for quick access to frequently asked questions.</li><li><strong>Notifications and Engagement</strong>: Real-time alerts for key events, birthdays, and updates, with interactive emoji reactions.</li><li><strong>Enhanced Security</strong>: Secure login with two-factor authentication (2FA) to ensure protected access.</li></ul><br>All these features were internally developed, ensuring a tailored, scalable, and fully optimized solution for the company’s needs. This intranet is a strategic asset for productivity, collaboration, and organizational efficiency across the network.",
    "miniature": "miniature-intranet",
    "images": [],
    "tag": [
      "PHP 8",
      "Intranet",
      "MySQL"
    ],
    "type": "web"
  },

  {
    "id": 11,
    "titre-fr": "Plugin WordPress - Immodvisor Review Showcase",
    "description-fr": "Ce plugin WordPress, développé en PHP, permet d'intégrer facilement les avis clients d'Immodvisor sur un site web à l'aide de shortcodes. Il améliore la crédibilité et la confiance des visiteurs grâce à des retours d'expérience authentiques. Voici ses principales fonctionnalités :<br><br><ul><li><strong>Affichage dynamique des avis</strong> : Permet d'afficher les avis récents, tous les avis ou la note moyenne directement sur le site grâce à des shortcodes personnalisables.</li><li><strong>Intégration API sécurisée</strong> : Communication avec l'API Immodvisor pour récupérer et afficher les avis vérifiés, avec gestion de cache pour optimiser les performances.</li><li><strong>Personnalisation via l'interface d'administration</strong> : Interface conviviale dans le back-office WordPress pour configurer les clés API, gérer les paramètres de récupération des avis, et vider manuellement le cache.</li><li><strong>Scripts et styles dédiés</strong> : Intégration de styles CSS et scripts JavaScript pour une présentation soignée des avis clients, incluant des étoiles de notation dynamiques et une pagination simple.</li><li><strong>Compatibilité WordPress</strong> : Développement suivant les standards WordPress, avec enregistrement de paramètres et nettoyage des transients pour garantir la stabilité et la compatibilité.</li></ul>",
    "titre-en": "WordPress Plugin - Immodvisor Review Showcase",
    "description-en": "This WordPress plugin, developed in PHP, seamlessly integrates Immodvisor customer reviews into a website using simple shortcodes. It enhances site credibility and trustworthiness by showcasing authentic user feedback. Key features include:<br><br><ul><li><strong>Dynamic Review Display</strong>: Enables displaying recent reviews, all reviews, or the average rating on the site via customizable shortcodes.</li><li><strong>Secure API Integration</strong>: Communicates with the Immodvisor API to fetch and display verified reviews, with caching mechanisms to improve performance.</li><li><strong>Admin Interface Customization</strong>: User-friendly back-office interface to configure API keys, manage review fetching parameters, and manually clear cached data.</li><li><strong>Dedicated Scripts and Styles</strong>: Includes CSS styles and JavaScript scripts for visually appealing review presentations, dynamic star ratings, and simple pagination.</li><li><strong>WordPress Compatibility</strong>: Developed according to WordPress standards, ensuring stable performance with settings registration and transient cleanup.</li></ul>",
    "miniature": "miniature-reviews",
    "images": [],
    "tag": [
      "PHP",
      "WordPress",
      "API Integration",
      "Custom Plugin",
      "Frontend & Backend Development"
    ],
    "type": "web"
  }

]