{
  "job": "Chef de Projet IT",
  "nav": {
    "lang": "Langage",
    "contact": "Me contacter",
    "projects": "Projets",
    "experience": "Expériences pro.",
    "education": "Formations",
    "profile": "Mon profil",
    "brand": "Portfolio"
  },
  "section": {
    "title": {
      "about": "Mon profil",
      "projects": "Mes projets",
      "experience": "Expériences professionnelles",
      "education": "Formations",
      "contact": "Me contacter"
    },
    "about": {
      "text": {
        "part1": "Bonjour, je m'appelle Cyril, j'ai",
        "part2": "ans et je suis Chef de Projet IT chez AFR Financement à Villeneuve-Saint-Germain.",
        "part3": "Je gère et coordonne les projets IT, en supervisant le développement et la sécurité des outils numériques internes. Mon rôle couvre toutes les phases des projets, de l'analyse des besoins à la mise en production.",
        "part4": "Je collabore avec les développeurs et les services métiers pour concevoir des solutions adaptées, tout en assurant l'évolution et la maintenance des applications, sites web et API.",
        "part5": "Mon expertise inclut les solutions web complexes, l’intégration d’API, la gestion des flux de données et le renforcement de la sécurité.",
        "part6": "Bonne visite sur mon portfolio !"
      }
    },

    "experience": {
      "afr-cp": {
        "date": "2025 – aujourd'hui",
        "job": "Chef de Projet IT • AFR financement • Villeneuve-Saint-Germain",
        "part1": "Gestion et coordination des projets IT, de l’<strong>analyse des besoins</strong> à la mise en production, en passant par la <strong>planification</strong>, le <strong>développement et le suivi d’avancement</strong>. Supervision des équipes de développement internes et externes pour garantir des livraisons <strong>de qualité</strong> et dans les délais impartis.",
        "part2": "Conception, amélioration et maintenance des <strong>applications internes</strong>, sites web et API. Identification des opportunités d’optimisation et proposition de solutions pour améliorer la <strong>performance</strong> des outils numériques.",
        "part3": "Veille technologique et recommandations pour optimiser les <strong>systèmes d’information</strong> et améliorer l’<strong>expérience utilisateur</strong>.",
        "part4": "Sécurisation des systèmes d’information : mise en place de protocoles garantissant la <strong>protection des données</strong>."
      },
      "afr-fs": {
        "date": "5 ans et 5 mois | 2019 – 2025",
        "job": "<strong>Développeur full-stack</strong> • AFR Financement • Villeneuve-Saint-Germain",
        "part1": "Développement et maintenance d'<strong>applications web</strong> pour la franchise AFR Financement.",
        "part2": "Développement et utilisation d'<strong>APIs</strong>.",
        "part3": "<strong>Gestion réseau</strong> et administration système : <ul><li>Paramétrage de sites sur <strong>Windows Server</strong>.</li><li>Planification de <strong>tâches automatisées</strong> pour la sauvegarde et la génération de rapports.</li></ul>",
        "part4": "Conception et maintenance de <strong>solutions web stratégiques</strong> pour améliorer l'efficacité des courtiers et automatiser des processus clés."
      },

      "emiled": {
        "date": "11 semaines | 2016 – 2017",
        "job": "Stagiaire IT • SARL EMILED • Laon",
        "part1": "Participation à des projets visant à renforcer la fidélisation et améliorer l'expérience client sur les plateformes e-commerce.",
        "part2": "Optimisation et maintenance de sites multi-boutiques sur <strong>Magento</strong>, incluant l'analyse et la correction de problèmes fonctionnels recensés.",
        "part3": "Recettage et validation d'une solution de personnalisation de produits en ligne, avec création de tutoriels vidéo pour faciliter l'utilisation par les utilisateurs finaux.",
        "part4": "Réalisation de campagnes de mailing avec <strong>Mailchimp</strong>, depuis la conception jusqu'à l'envoi, pour soutenir les actions marketing.",
        "part5": "Création de supports graphiques variés à l'aide de <strong>Photoshop</strong>, en lien avec les besoins marketing et la personnalisation de produits."
      }
    },
    "education": {
      "insset": {
        "part1": "<strong>Diplôme obtenu :</strong> Master Cloud Computing & Mobility • mention bien.",
        "part2": "<strong>Diplôme obtenu :</strong> Licence Métiers du Numérique.",
        "description1": "Ce Master forme des experts en développement mobile, micro-services et solutions cloud. La formation met l'accent sur la sécurité, l'IoT, et la gestion de projets, préparant les étudiants à des postes d’ingénieurs, chefs de projets ou consultants spécialisés.",
        "description2": "La Licence Métiers du Numérique de l'INSSET de Saint-Quentin forme les étudiants aux technologies numériques, web et cloud, avec des compétences en développement d'applications, bases de données, et apprentissage automatique."
      },
      "claudel": {
        "part1": "<strong>Diplôme obtenu :</strong> BTS Services Informatiques aux Organisations • mention bien.",
        "part2": "<strong> Option :</strong> Solutions logicielles et applications métiers.",
        "description": "Le BTS SIO prépare les étudiants à concevoir, développer et maintenir des solutions logicielles adaptées aux besoins des entreprises. L'option Solutions logicielles et applications métiers met l'accent sur les technologies de développement, la gestion des bases de données, et l’analyse des besoins métiers."
      },
      "nerval": {
        "part1": "<strong>Diplôme obtenu :</strong> Baccalauréat technologique • mention très bien.",
        "part2": "<strong> Options :</strong> Systèmes d'information de gestion et cinéma-audiovisuel.",
        "description": "Le Baccalauréat STMG, option Systèmes d’information de gestion, offre une initiation approfondie au développement web et à la gestion des données. \n L'option cinéma-audiovisuel enrichit mon parcours avec une approche créative et technique dans le domaine de la production audiovisuelle."
      }
    },
    "filter": {
      "web": "WEB",
      "software": "LOGICIEL",
      "mobile": "MOBILE",
      "all": "TOUS"
    }
  },
  "form": {
    "label": {
      "email": "Mail",
      "message": "Message"
    },
    "btn": {
      "send": "ENVOYER",
      "linkedin": "Mon profil LinkedIn",
      "details": "+ Détails"
    }
  }
}
