{
  "job": "Développeur full-stack",
  "nav": {
    "lang": "Langage",
    "contact": "Me contacter",
    "projects": "Projets",
    "experience": "Expériences pro.",
    "education": "Formations",
    "profile": "Mon Profil",
    "brand": "Portfolio"
  },
  "section": {
    "title": {
      "about": "Mon Profil",
      "projects": "Mes projets",
      "experience": "Expériences professionnelles",
      "education": "Formations",
      "contact": "Me contacter"
    },
    "about": {
      "text": {
        "part1": "Bonjour, je m'appelle Cyril, j'ai",
        "part2": "ans et je suis développeur Full-stack chez AFR financement, un réseau de centres de courtage en crédits situé à Villeneuve-Saint-Germain.",
        "part3": "En tant que membre d'une équipe de développeurs, je collabore étroitement avec mes collègues pour concevoir des solutions numériques innovantes qui répondent aux besoins et aux attentes de nos utilisateurs finaux.",
        "part4": "Dans mon rôle actuel, je suis impliqué dans toutes les phases du développement de projets web, de la conception initiale à la mise en production.",
        "part5": "J'ai travaillé sur des projets de toutes tailles, incluant des sites web simples, des applications web complexes, des projets d'e-commerce, ainsi que des petites applications mobiles.",
        "part6": "J'espère que vous apprécierez mon portfolio et je vous souhaite une bonne visite !"
      }
    },
    "experience": {
      "afr": {
        "date": "2019 – aujourd'hui",
        "job": "Développeur Full Stack",
        "part1": "Développement et maintenance d'applications web utilisées par l'ensemble de la franchise AFR Financement, incluant : <ul><li><strong>CRM pour courtiers en crédits - financements particuliers</strong> : Application web en Symfony conçue pour centraliser la gestion des leads, des dossiers clients et des documents contractuels, avec des outils d’analyse et un accès dédié pour les apporteurs d'affaires.</li><li><strong>CRM pour courtiers en crédits - financements professionnels</strong> : Application web offrant des fonctionnalités similaires au CRM précédent, avec une adaptation des processus pour répondre aux spécificités des financements professionnels.</li><li><strong>Comparateur de contrats d'assurance emprunteur</strong> : Connecté à une dizaine d'APIs de compagnies d'assurance, permettant une comparaison automatisée des offres selon les profils clients, avec export vers les extranets pour simplifier les souscriptions.</li><li><strong>Intranet </strong> : Fédère toutes les applications internes, avec des fonctionnalités collaboratives avancées pour centraliser la gestion des utilisateurs et des centres de courtage.</li><li><strong>Formulaires</strong> : Conception et développement de formulaires interactifs pour collecter efficacement les informations des prospects. Ces formulaires sont reliés aux CRM pour un suivi personnalisé et optimisé, avec une conception axée sur la conversion.</li></ul>",
        "part2": "API et intégrations API : <ul><li><strong>API Leads</strong> : Développement d'une API externe permettant aux partenaires de transmettre directement des leads aux différents CRM, garantissant un suivi fluide et automatisé.</li><li><strong>Client API Yousign</strong> : Création d'un client API en PHP pour simplifier l'intégration de la signature électronique via l'API Yousign.</li></ul>",
        "part3": "Gestion réseau et administration système : <ul><li><strong>Paramétrage de sites sur Windows Server</strong> : Configuration d'applications web et services hébergés sur des serveurs Windows.</li><li><strong>Planification de tâches automatisées</strong> : Mise en place de tâches planifiées pour automatiser des processus tels que la génération de rapports, la sauvegarde des données, ou des alertes.</li></ul>",
        "part4": "J'ai joué un rôle clé dans la conception, le développement et la maintenance de solutions web stratégiques pour AFR financement. Mon travail a permis d'améliorer l'efficacité opérationnelle des courtiers, d'automatiser des processus critiques et d'enrichir l'expérience utilisateur à l'échelle de la franchise."
      },
      "emiled": {
        "date": "11 semaines | 2016 – 2017",
        "job": "Stagiaire au service informatique",
        "part1": "Participation à des projets visant à renforcer la fidélisation et améliorer l'expérience client sur les plateformes e-commerce.",
        "part2": "Optimisation et maintenance de sites multi-boutiques sur <strong>Magento</strong>, incluant l'analyse et la correction de problèmes fonctionnels recensés.",
        "part3": "Recettage et validation d'une solution de personnalisation de produits en ligne, avec création de tutoriels vidéo pour faciliter l'utilisation par les utilisateurs finaux.",
        "part4": "Réalisation de campagnes de mailing avec <strong>Mailchimp</strong>, depuis la conception jusqu'à l'envoi, pour soutenir les actions marketing.",
        "part5": "Création de supports graphiques variés à l'aide de <strong>Photoshop</strong>, en lien avec les besoins marketing et la personnalisation de produits."
      }

    },
    "education": {
      "insset": {
        "part1": "<strong>Diplôme obtenu :</strong> Master Cloud Computing & Mobility • mention bien.",
        "part2": "<strong>Diplôme obtenu :</strong> Licence Métiers du Numérique.",
        "description1": "Ce Master forme des experts en développement mobile, micro-services et solutions cloud. La formation met l'accent sur la sécurité, l'IoT, et la gestion de projets, préparant les étudiants à des postes d’ingénieurs, chefs de projets ou consultants spécialisés.",
        "description2": "La Licence Métiers du Numérique de l'INSSET de Saint-Quentin forme les étudiants aux technologies numériques, web et cloud, avec des compétences en développement d'applications, bases de données, et apprentissage automatique."
      },
      "claudel": {
        "part1": "<strong>Diplôme obtenu :</strong> BTS Services Informatiques aux Organisations • mention bien.",
        "part2": "<strong> Option :</strong> Solutions logicielles et applications métiers.",
        "description": "Le BTS SIO prépare les étudiants à concevoir, développer et maintenir des solutions logicielles adaptées aux besoins des entreprises. L'option Solutions logicielles et applications métiers met l'accent sur les technologies de développement, la gestion des bases de données, et l’analyse des besoins métiers."
      },
      "nerval": {
        "part1": "<strong>Diplôme obtenu :</strong> Baccalauréat technologique • mention très bien.",
        "part2": "<strong> Options :</strong> Systèmes d'information de gestion et cinéma-audiovisuel.",
        "description": "Le Baccalauréat STMG, option Systèmes d’information de gestion, offre une initiation approfondie au développement web et à la gestion des données. \n L'option cinéma-audiovisuel enrichit mon parcours avec une approche créative et technique dans le domaine de la production audiovisuelle."
      }
    },
    "filter": {
      "web": "WEB",
      "software": "LOGICIEL",
      "mobile": "MOBILE",
      "all": "TOUS"
    }
  },
  "form": {
    "label": {
      "email": "Mail",
      "message": "Message"
    },
    "btn": {
      "send": "ENVOYER",
      "linkedin": "Mon profil LinkedIn",
      "details": "+ Détails"
    }
  }
}
